## 028051698106: ConfigRules
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 36 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cbs_default_kinesis_stream will be created
  + resource "aws_cloudwatch_log_group" "cbs_default_kinesis_stream" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/kinesisfirehose/cbs_default_kinesis_stream"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.cbs_s3_access_logs_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_s3_access_logs_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/CbsS3AccessLogsRule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_s3_satellite_bucket_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/CbsS3SatelliteBucketRule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.cbs_wafv2_logs_rule will be created
  + resource "aws_cloudwatch_log_group" "cbs_wafv2_logs_rule" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cbs-wafv2-logs-rule"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_config_config_rule.cbs_cloudtrail_enabled will be created
  + resource "aws_config_config_rule" "cbs_cloudtrail_enabled" {
      + arn              = (known after apply)
      + description      = "A Config rule that checks that CloudTrail is enabled and logging to a given bucket."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + s3BucketName = "cbs-satellite-028051698106"
            }
        )
      + name             = "cbs_cloudtrail_enabled"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::CloudTrail::Trail",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUD_TRAIL_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_elb_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_elb_logging_enabled" {
      + arn         = (known after apply)
      + description = "A Config rule that checks whether ELB logging is enabled."
      + id          = (known after apply)
      + name        = "cbs_elb_logging_enabled"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancing::LoadBalancer",
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELB_LOGGING_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_s3_bucket_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_s3_bucket_logging_enabled" {
      + arn              = (known after apply)
      + description      = "A Config rule that checks whether logging to the cbs satellite is enabled for your S3 buckets."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + targetBucket = "cbs-satellite-028051698106"
            }
        )
      + name             = "cbs_s3_bucket_logging_enabled"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = (known after apply)

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
    }

  # aws_config_config_rule.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_config_config_rule" "cbs_s3_satellite_bucket_rule" {
      + arn              = (known after apply)
      + description      = "Checks that the CBS satellite bucket exists in the account."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + satelliteBucket = "cbs-satellite-028051698106"
            }
        )
      + name             = "cbs_s3_satellite_bucket_rule"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = (known after apply)

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
    }

  # aws_config_config_rule.cbs_vpc_flow_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_vpc_flow_logging_enabled" {
      + arn         = (known after apply)
      + description = "A Config rule that checks whether VPC flow logs are enabled."
      + id          = (known after apply)
      + name        = "cbs_vpc_flow_logging_enabled"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::VPC",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "VPC_FLOW_LOGS_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_wafv2_logs_rule will be created
  + resource "aws_config_config_rule" "cbs_wafv2_logs_rule" {
      + arn         = (known after apply)
      + description = "Checks that the WAFV2 ACL's are logging to either S3 or Kinesis."
      + id          = (known after apply)
      + name        = "cbs_wafv2_logs_rule"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::WAFv2::WebACL",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = (known after apply)

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
    }

  # aws_iam_policy.aws_config_policy will be created
  + resource "aws_iam_policy" "aws_config_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CbsConfigPolicy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutBucketLogging",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "wafv2:PutLoggingConfiguration",
                          + "wafv2:GetLoggingConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:wafv2:::*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "IAM policy for listing all S3 buckets and their logging configuration"
      + id          = (known after apply)
      + name        = "CbsS3AccessLogsPolicy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketLogging",
                          + "config:PutEvaluations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.s3_list_buckets will be created
  + resource "aws_iam_policy" "s3_list_buckets" {
      + arn         = (known after apply)
      + description = "IAM policy for listing all S3 buckets"
      + id          = (known after apply)
      + name        = "CbsS3ListBuckets"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListAllMyBuckets"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.wafv2_list_web_acls will be created
  + resource "aws_iam_policy" "wafv2_list_web_acls" {
      + arn         = (known after apply)
      + description = "IAM policy for listing all WAFv2 ACLs"
      + id          = (known after apply)
      + name        = "cbs-wafv2-acls-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "wafv2:ListWebACLs",
                          + "wafv2:ListLoggingConfigurations",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetLoggingConfiguration",
                          + "iam:CreateServiceLinkedRole",
                          + "config:PutEvaluations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.write_waf_logs will be created
  + resource "aws_iam_policy" "write_waf_logs" {
      + arn         = (known after apply)
      + description = "Allow writing WAF logs to S3 + CloudWatch"
      + id          = (known after apply)
      + name        = "cbs-028051698106-write-waf-logs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-028051698106"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject*",
                          + "s3:GetObject*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-028051698106/waf_acl_logs/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy_attachment.aws-aws_config_policy-policy will be created
  + resource "aws_iam_policy_attachment" "aws-aws_config_policy-policy" {
      + id         = (known after apply)
      + name       = "CbsConfigPolicy"
      + policy_arn = (known after apply)
      + roles      = [
          + "CbsConfigPolicy",
        ]
    }

  # aws_iam_policy_attachment.managed_policy will be created
  + resource "aws_iam_policy_attachment" "managed_policy" {
      + id         = (known after apply)
      + name       = "CbsConfigManagedPolicy"
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSConfigRole"
      + roles      = [
          + "CbsConfigPolicy",
          + "CbsS3SatelliteBucketRule",
        ]
    }

  # aws_iam_role.cbs_s3_access_logs_rule will be created
  + resource "aws_iam_role" "cbs_s3_access_logs_rule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CbsS3AccessLogsRule"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_iam_role" "cbs_s3_satellite_bucket_rule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CbsS3SatelliteBucketRule"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cbs_wafv2_logs_rule will be created
  + resource "aws_iam_role" "cbs_wafv2_logs_rule" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cbs-wafv2-logs-rule"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.security_config will be created
  + resource "aws_iam_role" "security_config" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "config.amazonaws.com",
                              + "ssm.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CbsConfigPolicy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.waf_log_role will be created
  + resource "aws_iam_role" "waf_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cbs-028051698106-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.cbs_s3_access_logs_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_access_logs_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "CbsS3AccessLogsRule"
    }

  # aws_iam_role_policy_attachment.cbs_s3_access_logs_rule_policy will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_access_logs_rule_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CbsS3AccessLogsRule"
    }

  # aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_satellite_bucket_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "CbsS3SatelliteBucketRule"
    }

  # aws_iam_role_policy_attachment.cbs_s3_satellite_bucket_rule_s3_list_buckets will be created
  + resource "aws_iam_role_policy_attachment" "cbs_s3_satellite_bucket_rule_s3_list_buckets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CbsS3SatelliteBucketRule"
    }

  # aws_iam_role_policy_attachment.cbs_wafv2_logs_rule_basic_execution will be created
  + resource "aws_iam_role_policy_attachment" "cbs_wafv2_logs_rule_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "cbs-wafv2-logs-rule"
    }

  # aws_iam_role_policy_attachment.cbs_wafv2_logs_rule_wafv2_list_web_acls will be created
  + resource "aws_iam_role_policy_attachment" "cbs_wafv2_logs_rule_wafv2_list_web_acls" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cbs-wafv2-logs-rule"
    }

  # aws_iam_role_policy_attachment.write_waf_logs will be created
  + resource "aws_iam_role_policy_attachment" "write_waf_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cbs-028051698106-logs"
    }

  # aws_kinesis_firehose_delivery_stream.cbs_default_stream will be created
  + resource "aws_kinesis_firehose_delivery_stream" "cbs_default_stream" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "cbs-aws-waf-logs-028051698106"
      + tags           = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-028051698106"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "UNCOMPRESSED"
          + prefix             = "waf_acl_logs/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = true
              + log_group_name  = "/aws/kinesisfirehose/cbs_default_kinesis_stream"
              + log_stream_name = "WAFLogS3Delivery"
            }
        }
    }

  # aws_lambda_function.cbs_s3_access_logs_rule will be created
  + resource "aws_lambda_function" "cbs_s3_access_logs_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_s3_access_logs_rule.zip"
      + function_name                  = "CbsS3AccessLogsRule"
      + handler                        = "s3_access_logs_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "Y9QD3YDIyTpZOr/qi4pgHc6oa/Gn17oXmTG0rJkavZI="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_lambda_function" "cbs_s3_satellite_bucket_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_s3_satellite_bucket_rule.zip"
      + function_name                  = "CbsS3SatelliteBucketRule"
      + handler                        = "s3_satellite_bucket_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "i7UKalirZX27DnlHTzMuGMD+/ZZhoaHhUgRbtbBuUFk="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.cbs_wafv2_logs_rule will be created
  + resource "aws_lambda_function" "cbs_wafv2_logs_rule" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/cbs_wafv2_logs_rule.zip"
      + function_name                  = "cbs-wafv2-logs-rule"
      + handler                        = "webacl_logs_rule.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "jCX9PDXvZOdK1lA3jzrkKwYGm7iYzRHZHz0MCw5UeKo="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cbs-028051698106"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_permission.cbs_s3_access_logs_rule will be created
  + resource "aws_lambda_permission" "cbs_s3_access_logs_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

  # aws_lambda_permission.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_lambda_permission" "cbs_s3_satellite_bucket_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

  # aws_lambda_permission.cbs_wafv2_logs_rule will be created
  + resource "aws_lambda_permission" "cbs_wafv2_logs_rule" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "config.amazonaws.com"
      + statement_id  = "AllowExecutionFromConfig"
    }

Plan: 36 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_cloudtrail_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_elb_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_bucket_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_satellite_bucket_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_vpc_flow_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_wafv2_logs_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_config_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.security_config"]

16 tests, 8 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
